nxp-mcuxpresso/mcux-soc-svd/MCXN526/MCXN526_cm33_core1.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>PUF</name>
      <description>PUF</description>
      <groupName>PUF</groupName>
      <headerStructName>PUF</headerStructName>
      <baseAddress>0x4002C000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x3F0</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>PUF</name>
        <value>75</value>
      </interrupt>
      <registers>
        <register>
          <name>CR</name>
          <description>Control</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ZEROIZE</name>
              <description>Zeroize operation</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENROLL</name>
              <description>Enroll operation</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>START</name>
              <description>Start operation</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RECONSTRUCT</name>
              <description>Reconstruct operation</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STOP</name>
              <description>Stop operation</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GET_KEY</name>
              <description>Get Key operation</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UNWRAP</name>
              <description>Unwrap operation</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRAP_GENERATED_RANDOM</name>
              <description>Wrap Generated Random operation</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRAP</name>
              <description>Wrap operation</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GENERATE_RANDOM</name>
              <description>Generate Random operation</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEST_MEMORY</name>
              <description>Test memory operation</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEST_PUF</name>
              <description>Test PUF operation</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ORR</name>
          <description>Operation Result</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RESULT_CODE</name>
              <description>Result code of last operation</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OK</name>
                  <description>Indicates that the last operation was successful or operation is in progress.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ERR_PRODUCT</name>
                  <description>Indicates that the AC is not for the current product/version.</description>
                  <value>0xF0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ERR_PRODUCT_PH2</name>
                  <description>Indicates that the AC in the second phase is not for the current product/version.</description>
                  <value>0xF1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ERR_TRANSFER</name>
                  <description>Indicates that the AC is corrupted.</description>
                  <value>0xF2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ERR_TRANSFER_PH2</name>
                  <description>Indicates that the AC in the second phase is corrupted.</description>
                  <value>0xF3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ERR_AUTH</name>
                  <description>Indicates that the authentication of the provided AC failed.</description>
                  <value>0xF4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ERR_AUTH_PH2</name>
                  <description>Indicates that the authentication of the provided AC failed in the second phase.</description>
                  <value>0xF5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ERR_PUF_QUALITY</name>
                  <description>Indicates that the SRAM PUF quality verification fails.</description>
                  <value>0xF6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ERR_CONTEXT</name>
                  <description>Indicates that the incorrect or unsupported context is provided.</description>
                  <value>0xF7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ERR_DESTINATION</name>
                  <description>Indicates that a data destination was set that is not allowed according to other settings and the current PUF state.</description>
                  <value>0xF8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FAILURE</name>
                  <description>Indicates that the PUF SRAM access has failed.</description>
                  <value>0xFF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LAST_OPERATION</name>
              <description>Last operation type</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LO_PROGRESS</name>
                  <description>Indicates that the operation is in progress.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LO_ENROLL</name>
                  <description>Indicates that the last operation was Enroll.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LO_START</name>
                  <description>Indicates that the last operation was Start.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LO_RECONSTRUCT</name>
                  <description>Indicates that the last operation was Reconstruct</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LO_STOP</name>
                  <description>Indicates that the last operation was Stop.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LO_GET_KEY</name>
                  <description>Indicates that the last operation was Get Key.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LO_UNWRAP</name>
                  <description>Indicates that the last operation was Unwrap.</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LO_WRAP_GEN_RND</name>
                  <description>Indicates that the last operation was Wrap Generated Random.</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LO_WRAP</name>
                  <description>Indicates that the last operation was Wrap.</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LO_GEN_RND</name>
                  <description>Indicates that the last operation was Generate Random.</description>
                  <value>0xF</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LO_TEST_MEMORY</name>
                  <description>Indicates that the last operation was Test Memory.</description>
                  <value>0x1E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LO_TEST_PUF</name>
                  <description>Indicates that the last operation was Test PUF.</description>
                  <value>0x1F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LO_INITIALIZATION</name>
                  <description>Indicates that the last operation was Initialization.</description>
                  <value>0x20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LO_ZEROIZE</name>
                  <description>Indicates that the last operation was Zeroize.</description>
                  <value>0x2F</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <description>Status</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BUSY</name>
              <description>Operation in progress</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OK</name>
              <description>Last operation successful</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ERROR</name>
              <description>Last operation failed</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ZEROIZED</name>
              <description>Zeroized or Locked state</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REJECTED</name>
              <description>Operation rejected</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>DI_REQUEST</name>
              <description>Indicates the request for data in transfer via the DIR register</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DO_REQUEST</name>
              <description>Indicates the request for data out transfer via the DOR register</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AR</name>
          <description>Allow</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ALLOW_ENROLL</name>
              <description>Enroll operation</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Indicates that the Enroll operation is not allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Indicates that the Enroll operation is allowed</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ALLOW_START</name>
              <description>Start operation</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Indicates that the Start operation is not allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Indicates that the Start operation is allowed</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ALLOW_RECONSTRUCT</name>
              <description>Reconstruct operation</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Indicates that the Reconstruct operation is not allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Indicates that the Reconstruct operation is allowed</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ALLOW_STOP</name>
              <description>Stop operation</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Indicates that the Stop operation is not allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Indicates that the Stop operation is allowed</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ALLOW_GET_KEY</name>
              <description>Get Key operation</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Indicates that the Get Key operation is not allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Indicates that the Get Key operation is allowed</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ALLOW_UNWRAP</name>
              <description>Unwrap operation</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Indicates that the Unwrap operation is not allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Indicates that the Unwrap operation is allowed</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ALLOW_WRAP_GENERATED_RANDOM</name>
              <description>Wrap Generated Random operation</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Indicates that the Wrap Generated Random operation is not allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Indicates that the Wrap Generated Random operation is allowed</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ALLOW_WRAP</name>
              <description>Wrap operation</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Indicates that the Wrap operation is not allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Indicates that the Wrap operation is allowed</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ALLOW_GENERATE_RANDOM</name>
              <description>Generate Random operation</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Indicates that the Generate Random operation is not allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Indicates that the Generate Random operation is allowed</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ALLOW_TEST_MEMORY</name>
              <description>no description available</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Indicates that the Test Memory operation is not allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Indicates that the Test Memory operation is allowed</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ALLOW_TEST_PUF</name>
              <description>Test PUF operation</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Test PUF operation is not allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Test PUF operation is allowed</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>IER</name>
          <description>Interrupt Enable</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INT_EN</name>
              <description>Interrupt enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disables all PUF interrupts</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enables all PUF interrupts that are enabled in the Interrupt Mask register</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
